Revit 2026 API

# StairsWinderStyle Enumeration

---

The calculation method for the layout of the winder run steps.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum StairsWinderStyle
```
```vb
Public Enumeration StairsWinderStyle
```
```cpp
public enum class StairsWinderStyle
```
```fsharp
type StairsWinderStyle
```

| Member name | Value | Description |
| --- | --- | --- |
| Balanced | 0 | Symmetrical layout style. |
| SinglePoint | 2 | Asymmetrical layout style. Winder style is calculated from a single center point. |

#### Reference

Autodesk.Revit.DB.Architecture Namespace